[
  {
    "startingDate": "2019-04-01",
    "endingDate": "2019-06-01",
    "isInternship": true,
    "company": "INSA, laboratoire ICube",
    "location": "Strasbourg (67)",
    "title": "Stage de développement informatique",
    "description": "Création d'outils pour aider les chercheurs du laboratoire. Développement d'une interface Electron.js pour simplifier le scraping des résumés d'articles scientifiques provenant de sources multiples. Utilisation de Keras, Tensorflow et Scikit-Learn pour entraîner un modèle d'IA pour la classification précise des articles et proposer des solutions potentielles en utilisant la méthodologie TRIZ."
  },
  {
    "isInternship": true,
    "startingDate": "2020-01-01",
    "endingDate": "2020-04-01",
    "company": "ITS Future",
    "location": "Strasbourg (67)",
    "title": "Stage de développement informatique",
    "description": "Maintenance et amélioration d'une application web et mobile, en appliquant les méthodologies Agile et SCRUM. Utilisation d'Angular.ts pour le frontend, Spring (Java EE) pour le backend et Ionic pour l'application mobile. Création d'une API en utilisant Nest.js et Puppeteer."
  },
  {
    "isInternship": true,
    "startingDate": "2020-09-01",
    "endingDate": "2021-04-01",
    "company": "AnyDesk",
    "location": "Stuttgart (Allemagne)",
    "title": "Analyse développeur <span class='subtitle'>- stage</span>",
    "description": "AnyDesk développe une application de bureau à distance performante et multiplateforme utilisée dans le monde entier. En tant que développeur de logiciels, j'ai créé des outils pour améliorer le débogage et simplifier les développements futurs, améliorant ainsi l'efficacité de l'équipe de développement.",
    "bullets": [
      "Conception et création d'une application C++ haute performance, augmentant la fiabilité du système et améliorant la gestion des journaux.",
      "Implémentation de techniques de multithreading, réduisant les temps de traitement et améliorant l'expérience utilisateur.",
      "Résolution des défauts dans les bibliothèques, augmentant la stabilité de l'application et facilitant l'utilisation pour les utilisateurs finaux.",
      "Rédaction et mise à jour d'une documentation logicielle complète, assurant une traçabilité des modifications du code et réduisant les erreurs."
    ]
  },
  {
    "startingDate": "2022-02-01",
    "company": "3MA Group",
    "location": "Rouffach (68)",
    "title": "Ingénieur logiciel",
    "description": "3ma Group est une entreprise industrielle spécialisée dans le marketing, la production et la logistique. Je développe et maintiens des applications mobiles et bureau pour répondre aux besoins des clients et rationaliser les processus internes.",
    "bullets": [
      "Développement et lancement d'une application de bureau WPF consolidant plusieurs outils existants, augmentant l'efficacité des utilisateurs et améliorant l'évolutivité.",
      "Réorganisation de la base de code en C# et .NET, créant des frameworks optimisés et réduisant la dette technique.",
      "Résolution proactive des défauts logiciels signalés, assurant une qualité logicielle élevée et augmentant la satisfaction des utilisateurs.",
      "Participation active aux cérémonies Agile pour améliorer les processus de développement, réduisant les cycles de développement.",
      "Rédaction détaillée des spécifications techniques et de manuels d'utilisation, facilitant l'intégration de nouveaux membres et réduisant le temps de formation."
    ]
  }
]