[
    {
      "startingDate": "2019-04-01",
      "endingDate": "2019-06-01",
      "isInternship": true,
      "company": "INSA, laboratoire ICube",
      "location": "Strasbourg (67)",
      "title": "Stage de développement informatique",
      "description": "Création d'outils pour aider les chercheurs du laboratoire. Développement d'une interface Electron.js pour simplifier le scraping des résumés d'articles scientifiques provenant de sources multiples. Utilisation de Keras, Tensorflow et Scikit-Learn pour entraîner un modèle d'IA pour la classification précise des articles et proposer des solutions potentielles en utilisant la méthodologie TRIZ."
    },
    {
      "isInternship": true,
      "startingDate": "2020-01-01",
      "endingDate": "2020-04-01",
      "company": "ITS Future",
      "location": "Strasbourg (67)",
      "title": "Stage de développement informatique",
      "description": "Maintenance et amélioration d'une application web et mobile, en appliquant les méthodologies Agile et SCRUM. Utilisation d'Angular.ts pour le frontend, Spring (Java EE) pour le backend et Ionic pour l'application mobile. Création d'une API en utilisant Nest.js et Puppeteer."
    },
    {
      "isInternship": true,
      "startingDate": "2020-09-01",
      "endingDate": "2021-04-01",
      "company": "AnyDesk",
      "location": "Stuttgart (Allemagne)",
      "title": "Stage de développement informatique",
      "description": "Contribution à la création d'une application de bureau à distance hautement performante (AnyDesk), utilisant C++, Win32, SDL2 et DirectX. La société a donné la priorité à l'optimisation et au développement de code interne avec un minimum de bibliothèques externes.<ul><li>Conception et développement d'une application C++ pour analyser les journaux d'AnyDesk afin de simplifier le débogage.</li><li>Mise en œuvre de parsing et de composants graphiques complexes avec virtualisation pour traiter de grandes quantités de données.</li><li>Interactions avec Win32 pour fournir des fonctionnalités natives et gérer la communication multithread.</li><li>Réalisation de tests rigoureux et débogage des bibliothèques IPC et graphiques internes.</li><li>Documentation et suivi des bogues à l'aide de Jira et Confluence.</li></ul>"
    },
    {
      "startingDate": "2022-02-01",
      "company": "3MA Group",
      "location": "Rouffach (68)",
      "title": "Analyste développeur",
      "description": "Rôle d'analyste développeur utilisant les méthodologies Agile et SCRUM. Développement d'applications de bureau, d'applications mobiles, de sites web et d'API à l'aide des technologies Microsoft (C#, WPF, ASP.NET).<ul><li>Conception et mise en œuvre d'une application commerciale pour le traitement de fichiers PDF et le tri postal.</li><li>Rationalisation et automatisation des processus en consolidant différents logiciels et services dans une interface unifiée.</li><li>Création et maintenance de sites web et d'API avec ASP.NET et jquery.</li><li>Création et maintenance de bases de données relationnelles MSSQL, utilisation et amélioration d'une bibliothèque ORM C# personnalisée.</li><li>Construction de bibliothèques pour standardiser et simplifier le développement de projets, minimiser le code spécifique et promouvoir un code testé et documenté.</li><li>Fournir des idées pour créer, tester et mettre en place de nouveaux outils et de nouvelles bibliothèques pour faciliter la gestion et le développement de projets.</li></ul>"
    }
]