{
    "knowledges": {
        "title": "Connaissances",
        "description": "Liste des choses que je connais et avec lesquelles j'ai de l'expérience.",
        "contents": [
            {
                "group": "langage",
                "title": "C++",
                "description": "Langage de programmation généraliste, haute performance, avec des fonctionnalités orientées objet. J'aime beaucoup le contrôle précis sur les ressources.",
                "level": 3
            },
            {
                "group": "langage",
                "title": "Java",
                "description": "Langage de programmation orienté objet, indépendant de la plateforme. Un peu trop verbeux pour moi.",
                "level": 2
            },
            {
                "group": "langage",
                "title": "C#",
                "description": "Langage de programmation orienté objet, polyvalent, avec une intégration transparente à l'écosystème .NET. Mon langage de prédilection. Syntaxe claire, facile à utiliser, à déboguer, à compiler et à déployer.",
                "level": 3
            },
            {
                "group": "langage",
                "title": "Python",
                "description": "Langage de programmation interprété de haut niveau, renommé pour sa lisibilité, sa simplicité et ses bibliothèques étendues. J'aime beaucoup les petits trucs de syntaxe.",
                "level": 1
            },
            {
                "group": "langage",
                "title": "TypeScript",
                "description": "Langage dynamique et polyvalent, essentiel pour le développement web, connu pour sa facilité d'utilisation et son écosystème étendu. Tout est facile à faire, y compris les mauvais choix de conception.",
                "level": 3
            },
            {
                "group": "langage",
                "title": "HTML/CSS",
                "description": "HTML structure le contenu sur le web, tandis que CSS style et met en page ce contenu.",
                "level": 3
            },
            {
                "group": "Applications Web",
                "title": "Astro.js",
                "description": "Générateur de site statique moderne axé sur la performance et la simplicité. Totalement convaincu par l'interface utilisateur agnostique et la flexibilité.",
                "level": 2
            },
            {
                "group": "Applications Web",
                "title": "Webpack",
                "description": "Bundler de modules qui optimise et gère les dépendances, améliorant les performances et simplifiant le processus de développement. Devrait être utilisé sur chaque projet de taille moyenne et grande.",
                "level": 3
            },
            {
                "group": "Applications Web",
                "title": "Vite",
                "description": "Outil de construction moderne qui utilise des modules ES natifs et un serveur de développement ultra-rapide. Plus simple et plus rapide que Webpack. Je l'aime vraiment :)",
                "level": 2
            },
            {
                "group": "Frontend Web",
                "title": "Vuejs",
                "description": "Framework JavaScript progressif connu pour sa simplicité, sa flexibilité et sa réactivité. Un bon équilibre entre complexité et simplicité.",
                "level": 3
            },
            {
                "group": "Frontend Web",
                "title": "Angular",
                "description": "Plateforme pour construire des applications web évolutives et performantes. Bien structurée mais plus complexe que Vuejs.",
                "level": 1
            },
            {
                "group": "Frontend Web",
                "title": "SvelteKit",
                "description": "Framework d'application polyvalent basé sur Svelte, offrant un rendu côté serveur, un routage. Pour des applications web rapides et efficaces avec un minimum de code.",
                "level": 3
            },
            {
                "group": "Bases de données",
                "title": "MySQL",
                "description": "Système de gestion de base de données relationnelle open-source connu pour sa fiabilité, ses performances et sa facilité d'utilisation. Rien de spécial à dire à son sujet (ce qui est en quelque sorte un compliment).",
                "level": 3
            },
            {
                "group": "Bases de données",
                "title": "SQL Server",
                "description": "Système de gestion de base de données relationnelle robuste, de qualité entreprise, connu pour ses hautes performances, sa scalabilité et ses fonctionnalités avancées.",
                "level": 3
            },
            {
                "group": "Bases de données",
                "title": "MongoDB",
                "description": "Base de données NoSQL open-source connue pour sa flexibilité, sa scalabilité et sa capacité à gérer de grands volumes de données non structurées.",
                "level": 2
            },
            {
                "group": "IA",
                "title": "Keras",
                "description": "API de réseaux de neurones de haut niveau, conviviale, écrite en Python et capable de fonctionner sur TensorFlow, CNTK ou Theano.",
                "level": 2
            },
            {
                "group": "IA",
                "title": "Tensorflow",
                "description": "Framework d'apprentissage automatique open-source, connu pour son écosystème complet, sa scalabilité et sa flexibilité.",
                "level": 1
            },
            {
                "group": "Environnement",
                "title": "Docker",
                "description": "Plateforme qui automatise le déploiement, la mise à l'échelle et la gestion des applications en utilisant la conteneurisation. Idéal pour créer des environnements de développement complets.",
                "level": 3
            },
            {
                "group": "Multiplateforme",
                "title": "Maui",
                "description": "Framework multiplateforme pour la création d'applications natives sur les plateformes mobiles et de bureau. Beaucoup de problèmes différents qui doivent encore être résolus.",
                "level": 3
            },
            {
                "group": "Bureau",
                "title": "WPF",
                "description": "Framework UI puissant pour la création d'applications de bureau riches et interactives sur Windows, avec un système de mise en page flexible, la liaison de données et des capacités graphiques avancées. La syntaxe XAML est un peu lourde pour moi.",
                "level": 3
            },
            {
                "group": "Bureau",
                "title": "JavaFX",
                "description": "Kit d'outils UI moderne pour la création d'applications de bureau riches et multiplateformes, avec un accent sur les graphismes haute performance, un système de mise en page flexible et un ensemble complet de contrôles.",
                "level": 1
            },
            {
                "group": "Bureau",
                "title": "SDL2",
                "description": "Bibliothèque de développement multiplateforme conçue pour un accès de bas niveau à l'audio, au clavier, à la souris, au joystick et au matériel graphique.",
                "level": 3
            },
            {
                "group": "Bureau",
                "title": "SFML",
                "description": "Bibliothèque multiplateforme pour la création de jeux et d'applications multimédias, offrant une API simple pour la gestion des graphismes, de l'audio, des entrées, etc. Excellente façon de commencer le développement de jeux.",
                "level": 2
            },
            {
                "group": "Bureau",
                "title": "Electron",
                "description": "Applications de bureau multiplateformes utilisant des technologies web comme JavaScript, HTML et CSS, combinant le moteur de rendu Chromium et le runtime Node.js.",
                "level": 1
            },
            {
                "group": "Backend Web",
                "title": ".NET ASP (Framework / Core)",
                "description": "Framework web open-source pour la création d'applications et de services web modernes, évolutifs et performants, avec un ensemble riche d'outils et de bibliothèques. Parfois un peu trop magique pour moi.",
                "level": 3
            },
            {
                "group": "Backend Web",
                "title": "Laravel",
                "description": "Framework web open-source pour la création d'applications et de services web modernes, évolutifs et performants, avec un ensemble riche d'outils et de bibliothèques. La documentation est excellente, l'architecture de projet de base m'a beaucoup appris.",
                "level": 3
            },
            {
                "group": "Serveur Web",
                "title": "Nginx",
                "description": "Serveur web open-source haute performance et proxy inverse connu pour sa scalabilité, sa fiabilité et sa gestion efficace des connexions simultanées.",
                "level": 3
            },
            {
                "group": "Serveur Web",
                "title": "Apache",
                "description": "Serveur web open-source largement utilisé, connu pour sa fiabilité, sa flexibilité et son ensemble de fonctionnalités étendu.",
                "level": 1
            },
            {
                "group": "API Web",
                "title": "Node.js",
                "description": "Runtime JavaScript open-source basé sur le moteur V8 de Chrome, permettant des applications côté serveur et réseau avec un mode I/O non bloquant et événementiel.",
                "level": 3
            },
            {
                "group": "API Web",
                "title": "Express.js",
                "description": "Framework d'application web minimaliste et flexible pour Node.js, offrant un ensemble robuste de fonctionnalités pour les applications web et mobiles, connu pour sa simplicité, sa facilité d'utilisation et son support étendu de middleware.",
                "level": 3
            },
            {
                "group": "API Web",
                "title": "Fastify.js",
                "description": "Framework web hautement performant et à faible surcharge pour Node.js, conçu pour la création d'API rapides et évolutives, axé sur la vitesse, l'efficacité et la productivité des développeurs. Excellente alternative à Express.js.",
                "level": 1
            },
            {
                "group": "API Web",
                "title": "Lumen",
                "description": "Micro-framework de Laravel, conçu pour la création d'API et de microservices rapides et légers avec une configuration minimale.",
                "level": 1
            },
            {
                "group": "API Web",
                "title": "Slim",
                "description": "Micro-framework PHP léger et puissant, conçu pour la création d'applications web et d'API simples mais robustes, connu pour son design minimaliste, sa facilité d'utilisation et sa flexibilité.",
                "level": 1
            },
            {
                "title": "OpenAPI / Swagger",
                "description": "Framework open-source pour la conception, la construction, la documentation et la consommation de services web RESTful, connu pour son ensemble d'outils complet, incluant Swagger UI pour la documentation interactive des API.",
                "level": 2
            }
        ]
    },
    "experimentations": {
        "title": "Expérimentations",
        "description": "Liste des choses avec lesquelles j'ai expérimenté, mais sans en faire un projet complet.",
        "contents": [
            {
                "group": "langage",
                "title": "rust",
                "description": "Langage de programmation connu pour sa sécurité mémoire, ses performances et son support de la concurrence, offrant une syntaxe moderne. Syntaxe particulière, nécessite un peu de temps pour s'y habituer."
            },
            {
                "group": "langage",
                "title": "Kotlin",
                "description": "Langage de programmation moderne, statiquement typé, fonctionnant sur la JVM, connu pour sa syntaxe concise, son interopérabilité avec Java et ses fonctionnalités puissantes comme la sécurité des nulls et les coroutines."
            },
            {
                "group": "langage",
                "title": "Swift",
                "description": "Langage de programmation puissant et intuitif développé par Apple pour la création d'applications iOS, macOS, watchOS et tvOS, connu pour sa syntaxe moderne, ses fonctionnalités de sécurité et ses performances. J'aime beaucoup le concept de storyboard. Le seul inconvénient est qu'il est uniquement pour Apple."
            },
            {
                "group": "multiplateforme",
                "title": "Tauri",
                "description": "Framework pour la création d'applications de bureau plus petites, plus rapides et plus sécurisées en utilisant des technologies web, combinant un backend minimal basé sur Rust avec un frontend construit avec n'importe quel framework web. Bonne alternative à Electron, mais encore en développement précoce."
            },
            {
                "group": "multiplateforme",
                "title": "Flutter",
                "description": "Kit d'outils UI open-source pour la création d'applications compilées nativement pour mobile, web et bureau à partir d'une seule base de code. Pas vraiment fan du fait qu'il est très facile de mélanger logique et UI."
            },
            {
                "group": "multiplateforme",
                "title": "Avalonia UI",
                "description": "Framework UI .NET open-source et multiplateforme permettant la création d'applications de bureau modernes et réactives pour Windows, macOS et Linux."
            },
            {
                "group": "multiplateforme",
                "title": "Apache cordova",
                "description": "Framework de développement mobile open-source permettant aux développeurs de créer des applications mobiles multiplateformes en utilisant HTML, CSS et JavaScript, les enveloppant dans des conteneurs natifs pour accéder aux fonctionnalités et API spécifiques aux appareils."
            },
            {
                "group": "multiplateforme",
                "title": "Ionic",
                "description": "Framework open-source pour la création d'applications mobiles et web multiplateformes en utilisant des technologies web comme HTML, CSS et JavaScript, connu pour ses composants UI riches et ses performances. Beaucoup de composants préconstruits intéressants."
            },
            {
                "group": "web",
                "title": "React",
                "description": "Bibliothèque JavaScript populaire pour la création d'interfaces utilisateur, connue pour son architecture basée sur les composants, sa syntaxe déclarative et son DOM virtuel efficace. La syntaxe est lourde (Dieu nous préserve de JSX et des états)."
            },
            {
                "group": "web",
                "title": "Nuxt",
                "description": "Framework open-source basé sur Vue.js, conçu pour la création d'applications web rendues côté serveur (SSR) et générées statiquement."
            },
            {
                "group": "bureau",
                "title": "Ultralight.cpp",
                "description": "Render HTML léger et haute performance et kit d'outils UI pour C++, conçu pour intégrer des technologies web dans des applications de bureau."
            },
            {
                "group": "backend",
                "title": "Redis",
                "description": "Magasin de structures de données en mémoire open-source connu pour ses hautes performances, sa flexibilité et son support pour divers types de données, le rendant idéal pour le cache, l'analyse en temps réel et l'accès rapide aux données."
            },
            {
                "group": "backend",
                "title": "AppWrite",
                "description": "Serveur backend open-source fournissant aux développeurs un ensemble d'API faciles à utiliser pour gérer l'authentification, les bases de données, le stockage, etc., permettant un développement rapide d'applications web et mobiles modernes."
            }
        ]
    }
}
