[
    {
      "startingDate": "2019-04-01",
      "endingDate": "2019-06-01",
      "isInternship": true,
      "company": "INSA, laboratoire ICube",
      "location": "Strasbourg (67)",
      "title": "IT developer internship",
      "description": "Creation of tools to help the laboratory's researchers. Development of an Electron.js interface to simplify the scrapping of scientific article abstracts from multiple sources. Used Keras, Tensorflow and Scikit-Learn to train an AI model for accurate classification of articles and propose potential solutions using TRIZ methodology."
    },
    {
      "isInternship": true,
      "startingDate": "2020-01-01",
      "endingDate": "2020-04-01",
      "company": "ITS Future",
      "location": "Strasbourg (67)",
      "title": "IT developer internship",
      "description": "Maintenance and enhancement of a web and mobile application, applying Agile and SCRUM methodologies. Use of Angular.ts for the frontend, Spring (Java EE) for the backend, and Ionic for the mobile application. Creation of an API using Nest.js and Puppeteer."
    },
    {
      "isInternship": true,
      "startingDate": "2020-09-01",
      "endingDate": "2021-04-01",
      "company": "AnyDesk",
      "location": "Stuttgart (Germany)",
      "title": "IT developer internship",
      "description": "Contributed to the development of a high-performance remote desktop application (AnyDesk) created with C++, Win32, SDL2 and DirectX. The company focus on making optimized and in house code by using the least external libraries possible.<ul><li>Design and developpement of an application to read logs from the AnyDesk application, enabling remote loading of log files to facilitate debugging by developers.</li><li>Creation of low-level graphical components using the company's custom library. Testing and fixing bugs in the internal IPC and graphic libraries.</li></ul>"
    },
    {
      "startingDate": "2022-02-01",
      "company": "3MA Group",
      "location": "Rouffach (68)",
      "title": "Analyst Developer",
      "description": "Worked as an analyst developer using Agile and SCRUM methodologies. Developed desktop and mobile applications, websites and APIs using Microsoft technologies (C#, WPF, ASP).<br/><ul><li>Conception et création d'une application métier de traitement de fichier PDF et de tris postaux. Facilité et automatisé les traitements, regroupés différents logiciels et services en une interface unique.</li><li>Mise a niveau, maintenance et amélioration d'applications existantes utilisant un large éventaille de technologies. Comprendre les besoins métier et utilisateur et intégration de fonctionnalités dans l'ecosysteme existant</li><li>Mise en place de librairies et standards afin d'uniformiser et simplifier le développment de projets. Recherche et test de nouvelles technologies.</li></ul>"
    }
]