[
    {
      "startingDate": "2019-04-01",
      "endingDate": "2019-06-01",
      "isInternship": true,
      "company": "INSA, laboratoire ICube",
      "location": "Strasbourg (67)",
      "title": "IT developer internship",
      "description": "Creation of tools to help the laboratory's researchers. Development of an Electron.js interface to simplify the scrapping of scientific article abstracts from multiple sources. Used Keras, Tensorflow and Scikit-Learn to train an AI model for accurate classification of articles and propose potential solutions using TRIZ methodology."
    },
    {
      "isInternship": true,
      "startingDate": "2020-01-01",
      "endingDate": "2020-04-01",
      "company": "ITS Future",
      "location": "Strasbourg (67)",
      "title": "IT developer internship",
      "description": "Maintenance and enhancement of a web and mobile application, applying Agile and SCRUM methodologies. Use of Angular.ts for the frontend, Spring (Java EE) for the backend, and Ionic for the mobile application. Creation of an API using Nest.js and Puppeteer."
    },
    {
      "isInternship": true,
      "startingDate": "2020-09-01",
      "endingDate": "2021-04-01",
      "company": "AnyDesk",
      "location": "Stuttgart (Germany)",
      "title": "IT developer internship",
      "description": "Contributed to the development of a high-performance remote desktop application created with C++. Design and implementation of specialized software for reading application logs, with the possibility of loading logs from remote computers. Enhancement of the in-house graphics and IPC library."
    },
    {
      "startingDate": "2022-02-01",
      "company": "3MA Group",
      "location": "Rouffach (68)",
      "title": "Analyst Developer",
      "description": "Worked as an analyst developer using Agile and SCRUM methodologies. Developed desktop and mobile applications, websites and APIs using Microsoft technologies (C#, WPF, ASP). <br/>My responsibilities included:<ul><li>Takeover and maintenance of existing applications, with ongoing user support. Improving and upgrading these applications where possible.</li><li>Design and development of new projects in response to customer needs, carrying out a complete analysis and integration of existing tools and processes.</li><li>Enhancement and creation of shared libraries between the company's various projects, with standardization of styles and components used.</li></ul>"
    }
]