[
  {
    "startingDate": "2019-04-01",
    "endingDate": "2019-06-01",
    "isInternship": true,
    "company": "INSA, laboratoire ICube",
    "location": "Strasbourg (67)",
    "title": "IT developer internship",
    "description": "Creation of tools to help the laboratory's researchers. Development of an Electron.js interface to simplify the scrapping of scientific article abstracts from multiple sources. Used Keras, Tensorflow and Scikit-Learn to train an AI model for accurate classification of articles and propose potential solutions using TRIZ methodology."
  },
  {
    "isInternship": true,
    "startingDate": "2020-01-01",
    "endingDate": "2020-04-01",
    "company": "ITS Future",
    "location": "Strasbourg (67)",
    "title": "IT developer internship",
    "description": "Maintenance and enhancement of a web and mobile application, applying Agile methodologies. Use of Angular.ts for the frontend, Spring (Java EE) for the backend, and Ionic for the mobile application. Creation of an API using Nest.js and Puppeteer."
  },
  {
    "isInternship": true,
    "startingDate": "2020-09-01",
    "endingDate": "2021-04-01",
    "company": "AnyDesk",
    "location": "Stuttgart (Germany)",
    "title": "Analyst Developer <span class='subtitle'>- internship</span>",
    "description": "AnyDesk develops a high-performance, cross-platform remote desktop application used worldwide. As a Software Developer, I created tools to improve debugging and simplify future developments, enhancing the efficiency and effectiveness of the development team.",
    "bullets": [
      "Designed and created a highly performant desktop application using C++, significantly improving log handling and enhancing overall system reliability.",
      "Implemented multi-threading techniques to enhance application performance, resulting in noticeably smoother user experiences and reduced processing times.",
      "Troubleshot and resolved software defects in libraries, enhancing the application's stability and usability for end-users.",
      "Developed and maintained comprehensive software documentation, ensuring all code changes were well-documented and easily understood by the development team."
    ]
  },
  {
    "startingDate": "2022-02-01",
    "company": "3MA Group",
    "location": "Rouffach (68)",
    "title": "Software Engineer",
    "description": "3ma Group is an industrial company specializing in marketing, production, and logistics. I develop and maintain mobile and desktop applications to meet client needs and streamline internal processes.",
    "bullets": [
      "Developed and launched a new WPF desktop application consolidating multiple existing tools, enhancing user efficiency and scalability.",
      "Refactored legacy codebase in C# and .NET, creating frameworks and improving code maintainability, significantly reducing technical debt.",
      "Debugged and resolved software defects reported by QA and end-users, maintaining high standards of software quality and boosting user satisfaction.",
      "Collaborated with cross-functional teams in Agile ceremonies to drive continuous improvement in development processes.",
      "Authored technical specifications and created user manuals, facilitating smooth onboarding for new team members and end-users."
    ]
  }
]