{
    "knowledges": {
        "title": "Knowledges",
        "description": "List of the things I know and have experience with.",
        "contents": [
            {
                "group": "language",
                "title": "C++",
                "description": "High-performance, general-purpose programming language with object-oriented features. Like a lot the precise control over resources.",
                "level": 3
            },
            {
                "group": "language",
                "title": "Java",
                "description": "Platform-independent, object-oriented programming language. A little bit too verbose for me.",
                "level": 2
            },
            {
                "group": "language",
                "title": "C#",
                "description": "versatile, object-oriented programming language, seamless integration with the .NET ecosystem. My go to language. Clear syntax, easy to use, easy to debug, easy to compile, easy to deploy.",
                "level": 3
            },
            {
                "group": "language",
                "title": "Python",
                "description": " High-level, interpreted programming language renowned for its readability, simplicity, and extensive libraries. I do like all the small syntax tricks.",
                "level": 1
            },
            {
                "group": "language",
                "title": "TypeScript",
                "description": "Dynamic, versatile language essential for web development, known for its ease of use and extensive ecosystem. Everything is easy to do, and so is making bad design choices.",
                "level": 3
            },
            {
                "group": "language",
                "title": "HTML/CSS",
                "description": "HTML structures content on the web, while CSS styles and layouts that content.",
                "level": 3
            },
            {
                "group": "Web apps",
                "title": "Astro.js",
                "description": "Modern static site builder focused on performance and simplicity. Totally onboard with the UI-agnostic and the flexibility.",
                "level": 2
            },
            {
                "group": "Web apps",
                "title": "Webpack",
                "description": "Module bundler that optimizes and manages dependencies, enhancing performance and simplifying the development process. Should be used on every medium and big project.",
                "level": 3
            },
            {
                "group": "Web apps",
                "title": "Vite",
                "description": "Modern build tool that leverages native ES modules and a lightning-fast development server. Simpler and faster than webpack. I really like it :)",
                "level": 2
            },
            {
                "group": "Web frontend",
                "title": "Vuejs",
                "description": "Progressive JavaScript framework known for its simplicity, flexibility, and reactivity. A good balance between complexity and simplicity.",
                "level": 3
            },
            {
                "group": "Web frontend",
                "title": "Angular",
                "description": "Platform for building scalable, high-performance web applications. Well structured but more complexe than Vuejs.",
                "level": 1
            },
            {
                "group": "Web frontend",
                "title": "SvelteKit",
                "description": "versatile application framework built on Svelte, offering server-side rendering, routing. For fast, efficient web applications with minimal boilerplate.",
                "level": 3
            },
            {
                "group": "Databases",
                "title": "MySQL",
                "description": "Open-source relational database management system known for its reliability, performance, and ease of use. Nothing special to say about it (which is kinda a compliment).",
                "level": 3
            },
            {
                "group": "Databases",
                "title": "SQL Server",
                "description": "Robust, enterprise-grade relational database management system known for its high performance, scalability, and advanced features.",
                "level": 3
            },
            {
                "group": "Databases",
                "title": "MongoDB",
                "description": "Open-source NoSQL database known for its flexibility, scalability, and ability to handle large volumes of unstructured data.",
                "level": 2
            },
            {
                "group": "AI",
                "title": "Keras",
                "description": "High-level, user-friendly neural networks API, written in Python and capable of running on top of TensorFlow, CNTK, or Theano.",
                "level": 2
            },
            {
                "group": "AI",
                "title": "Tensorflow",
                "description": "Open-source machine learning framework, known for its comprehensive ecosystem, scalability, and flexibility.",
                "level": 1
            },
            {
                "group": "Environment",
                "title": "Docker",
                "description": " Platform that automates the deployment, scaling, and management of applications using containerization. Nice to create complete development environments.",
                "level": 3
            },
            {
                "group": "Multiplatform",
                "title": "Maui",
                "description": "Cross-platform framework for building native applications on mobile and desktop platforms. A lot of different problems that still need to be issued.",
                "level": 3
            },
            {
                "group": "Desktop",
                "title": "WPF",
                "description": "Powerful UI framework for building rich, interactive desktop applications on Windows, featuring a flexible layout system, data binding, and advanced graphics capabilities. The XAML syntax is a little bit heavy for me.",
                "level": 3
            },
            {
                "group": "Desktop",
                "title": "JavaFX",
                "description": "Modern UI toolkit for building rich, cross-platform desktop applications with a focus on high-performance graphics, a flexible layout system, and a comprehensive set of controls.",
                "level": 1
            },
            {
                "group": "Desktop",
                "title": "SDL2",
                "description": "Cross-platform development library designed for low-level access to audio, keyboard, mouse, joystick, and graphics hardware.",
                "level": 3
            },
            {
                "group": "Desktop",
                "title": "SFML",
                "description": "Cross-platform library for creating games and multimedia applications, offering a simple API for handling graphics, audio, input, and more. Great way to start with game development.",
                "level": 2
            },
            {
                "group": "Desktop",
                "title": "Electron",
                "description": "Cross-platform desktop applications using web technologies like JavaScript, HTML, and CSS, combining the Chromium rendering engine and the Node.js runtime.",
                "level": 1
            },
            {
                "group": "Web backend",
                "title": ".NET ASP (Framework / Core)",
                "description": "Open-source web framework for building modern, scalable, and high-performance web applications and services, featuring a rich set of tools and libraries. Sometime a little bit too magical for me.",
                "level": 3
            },
            {
                "group": "Web backend",
                "title": "Laravel",
                "description": "Open-source web framework for building modern, scalable, and high-performance web applications and services, featuring a rich set of tools and libraries. The documentation is great, base project architecture taught me a lot.",
                "level": 3
            },
            {
                "group": "Web server",
                "title": "Nginx",
                "description": "High-performance, open-source web server and reverse proxy known for its scalability, reliability, and efficient handling of concurrent connections.",
                "level": 3
            },
            {
                "group": "Web server",
                "title": "Apache",
                "description": "Widely-used, open-source web server known for its reliability, flexibility, and extensive feature set.",
                "level": 1
            },
            {
                "group": "Web API",
                "title": "Node.js",
                "description": "Open-source JavaScript runtime built on Chrome's V8 engine, enabling server-side and networking applications with an event-driven, non-blocking I/O mode.",
                "level": 3
            },
            {
                "group": "Web API",
                "title": "Express.js",
                "description": "Minimal and flexible Node.js web application framework that provides a robust set of features for web and mobile applications, known for its simplicity, ease of use, and extensive middleware support.",
                "level": 3
            },
            {
                "group": "Web API",
                "title": "Fastify.js",
                "description": "Highly performant and low-overhead web framework for Node.js, designed for building fast and scalable APIs with a focus on speed, efficiency, and developer productivity. Greate alternative to Express.js.",
                "level": 1
            },
            {
                "group": "Web API",
                "title": "Lumen",
                "description": "Micro-framework by Laravel, designed for building fast, lightweight APIs and microservices with minimal configuration.",
                "level": 1
            },
            {
                "group": "Web API",
                "title": "Slim",
                "description": "Lightweight, powerful PHP micro-framework designed for building simple yet robust web applications and APIs, known for its minimalistic design, ease of use, and flexibility.",
                "level": 1
            },
            {
                "title": "OpenAPI / Swagger",
                "description": "Open-source framework for designing, building, documenting, and consuming RESTful web services, known for its comprehensive toolset, including Swagger UI for interactive API documentation.",
                "level": 2
            }
        ]
    },
    "experimentations": {
        "title": "Experimentations",
        "description": "List of the things I experimented with, but didn't made a full project with.",
        "contents": [
            {
                "group": "language",
                "title": "rust",
                "description": "Programming language known for its memory safety, performance, and concurrency support, offering a modern syntax. Peculiar syntax, need some time to be used to."
            },
            {
                "group": "language",
                "title": "Kotlin",
                "description": "Modern, statically typed programming language that runs on the JVM, known for its concise syntax, interoperability with Java, and powerful features like null safety and coroutines."
            },
            {
                "group": "language",
                "title": "Swift",
                "description": "Powerful, intuitive programming language developed by Apple for building iOS, macOS, watchOS, and tvOS applications, known for its modern syntax, safety features, and performance. I like a lot the storyboard concept. The only downside is that it's only for Apple."
            },
            {
                "group": "multi-platform",
                "title": "Tauri",
                "description": "Framework for building smaller, faster, and more secure desktop applications using web technologies, combining a minimal Rust-based backend with a frontend built with any web framework. Nice alternative to Electron, but still in early development."
            },
            {
                "group": "multi-platform",
                "title": "Flutter",
                "description": "Open-source UI toolkit for building natively compiled applications for mobile, web, and desktop from a single codebase. Not realy fan of the fact that it's really easy to mix logic and UI."
            },
            {
                "group": "multi-platform",
                "title": "Avalonia UI",
                "description": "Cross-platform, open-source .NET UI framework that enables the creation of modern, responsive desktop applications for Windows, macOS, and Linux."
            },
            {
                "group": "multi-platform",
                "title": "Apache cordova",
                "description": "Open-source mobile development framework that allows developers to build cross-platform mobile applications using HTML, CSS, and JavaScript, wrapping them in native containers to access device-specific features and APIs."
            },
            {
                "group": "multi-platform",
                "title": "Ionic",
                "description": "Open-source framework for building cross-platform mobile and web applications using web technologies like HTML, CSS, and JavaScript, known for its rich UI components, performance. A lot of nice prebuilt components."
            },
            {
                "group": "web",
                "title": "React",
                "description": "Popular JavaScript library for building user interfaces, known for its component-based architecture, declarative syntax, and efficient virtual DOM. The syntax is heavy (God forbid JSX and states)."
            },
            {
                "group": "web",
                "title": "Nuxt",
                "description": "Open-source framework built on top of Vue.js, designed for creating server-side rendered (SSR) and statically generated web applications."
            },
            {
                "group": "desktop",
                "title": "Ultralight.cpp",
                "description": "Lightweight, high-performance HTML renderer and UI toolkit for C++, designed for embedding web technologies in desktop applications."
            },
            {
                "group": "backend",
                "title": "Redis",
                "description": "Open-source, in-memory data structure store known for its high performance, flexibility, and support for various data types, making it ideal for caching, real-time analytics, and fast data access."
            },
            {
                "group": "backend",
                "title": "AppWrite",
                "description": "Open-source backend server that provides developers with a set of easy-to-use APIs for managing authentication, databases, storage, and more, enabling rapid development of modern web and mobile applications."
            }
        ]
    },
    "certifications": [
        {
            "name": "TOEIC",
            "date": "2021-01-01",
            "description": "With a score of 990"
        },
        {
            "name": "CCNA",
            "date": "2020-09-01",
            "description": "CCNA 2 : Switching, Routing, and Wireless Essentials"
        }
    ],
    "educations": [
        {
            "name": "Master's degree in Computer Science",
            "location": "CESI - Strasbourg (67)",
            "startingDate": "2017-09-01",
            "endingDate": "2022-09-01",
            "description": "Major in Software Engineering specialized in cybersecurity"
        }
    ]
}